TakoyakiFuwa/stm32f4/main/Shadow.c
#include "Shadow.h"
/*  架构库  */
#include "Func.h"
#include "BaseFunc.h"
/*  ST库  */
#include "stm32f4xx.h"
#include "stm32f4xx_conf.h"
/*  OS库  */
#include "FreeRTOS.h"
#include "task.h"
/*  外设库  */
#include "U_USART.h"
/*  FATFS  */
#include "ff.h"
/*  设备库  */
#include "TFT_ST7735.h"
/*  BMP解码  */
#include "BMP.h"
#include "UR_USART.h"

/*	希望我这次重新写模板可以用的久一点...
 *	想开始做一些很有趣的项目....
 *	以及...很想mo....
 *		——2025/5/20-14:41
 */

/**@brief  用于main中的接口
  */
void Main_Start(void* pvParameters)
{
	//基本功能函数
	BF_Start();
	//初始化 建议格式:Init_XXX()
	Init_Func();
//	Init_TFT();
	Init_BMP();
	Init_UR();
	
	//线程	 建议格式:Task_XXX()
		//进入临界区
	taskENTER_CRITICAL();
		//Func测试
	TaskHandle_t TASK_FUNC_Handler;
	xTaskCreate(Task_Func,"Func",64,NULL,1,&TASK_FUNC_Handler);
	
		//退出临界区
	taskEXIT_CRITICAL();	
	//打印各线程栈
//	BF_Stack();
	//删除自身线程
	vTaskDelete(NULL);
}
/**@brief  命令行创建接口
  *@param  1有匹配 0没匹配转到BaseFunc
  */
int8_t Cmd(void)
{
	//COMMAND
	if(Command("COMMAND"))
	{
		U_Printf("这里是F407VE的模板程序 \r\n");
	}
		//FUNC测试
	else if(Command("FUNC"))
	{
		Cmd_Func();
	}
		//TFT颜色测试
	else if(Command("TFT"))
	{
		Cmd_TFT_XYTest();
		U_Printf("颜色输出 \r\n");
	}
	else if(Command("WQ"))
	{
		char path[] = {"0:/bmp10.bmp"};
		uint8_t a=0;
		uint8_t b=0;
		
		uint8_t width,height;
		BMP_GetResize(path,&width,&height,a);
		U_Printf("即将通过USART1输出图片:%s (%d:%d)\r\n",path,width,height);
		UR_Putchar(width);
		UR_Putchar(height);
		BMP_BMP((const char*)path,a,b);
		BMP_ChangeFunc(U_RGB);
		BMP_BMP((const char*)path,a,b);
		BMP_ChangeFunc(TFT_WriteData16);
		U_Printf("\r\n\r\n\r\n\r\n处理完成!!! \r\n");
	}
	//CLI :>
	else if(Command("HELP"))
	{
		U_Printf("HELP	  : 获取可用命令行 \r\n");
		U_Printf("COMMAND : 查看当前程序信息 \r\n");
		U_Printf("RESET	  : 系统重启 \r\n");
		U_Printf("STACK	  : 获取各线程剩余栈 \r\n");
		U_Printf("FUNC	  : 架构库Func.h测试命令行 \r\n");
	}
	else
	{
		return 0;
	}
	return 1;
} 











